Tekla.Structures.Model.ModelObject.GetAllUserProperties(System.Collections.Hashtable@)
Retrieves all properties for the model object in one hashtable.
Type for the returned value must be checked using type casting.
Values: The return value, a hash table that contains all the values that were retrieved successfully.
Returns: True if at least one single property was retrieved successfully.

Tekla.Structures.Model.ModelObject.GetIntegerUserProperties(System.Collections.Hashtable@)
Retrieves all integer properties for the model object.
Values: The return value, a hash table that contains all the values that were retrieved successfully.
Returns: True if at least one single property was retrieved successfully.

Tekla.Structures.Model.ModelObject.GetDoubleUserProperties(System.Collections.Hashtable@)
Retrieves all double properties for the model object.
Values: The return value, a hash table that contains all the values that were retrieved successfully.
Returns: True if at least one single property was retrieved successfully.

Tekla.Structures.Model.ModelObject.GetStringUserProperties(System.Collections.Hashtable@)
Retrieves all string properties for the model object.
Values: The return value, a hash table that contains all the values that were retrieved successfully.
Returns: True if at least one single property was retrieved successfully.

Tekla.Structures.Model.ModelObject.GetAllReportProperties(System.Collections.ArrayList,System.Collections.ArrayList,System.Collections.ArrayList,System.Collections.Hashtable@)
Retrieves all properties for the model object in one hashtable.
Type for the returned value must be checked using type casting.
In the following example a connection to the Tekla Structures model has already been established and
next the values of some report properties attributes are going to be found out for bolt groups in model.
using Tekla.Structures.Model;
using System;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
ArrayList sNames = new ArrayList();
sNames.Add("NAME");
sNames.Add("SCREW_NAME");
sNames.Add("SCREW_TYPE");
sNames.Add("TYPE");
sNames.Add("TYPE1");
sNames.Add("TYPE2");
sNames.Add("TYPE3");
sNames.Add("TYPE4");
sNames.Add("STANDARD");
sNames.Add("SHORT_NAME");
sNames.Add("MATERIAL");
sNames.Add("FINISH");
sNames.Add("GRADE");
ArrayList iNames = new ArrayList();
iNames.Add("DATE");
iNames.Add("FATHER_ID");
iNames.Add("GROUP_ID");
iNames.Add("HIERARCHY_LEVEL");
iNames.Add("MODEL_TOTAL");
ArrayList dNames = new ArrayList();
dNames.Add("EXTRA_LENGTH");
dNames.Add("FLANGE_THICKNESS");
dNames.Add("FLANGE_WIDTH");
dNames.Add("HEIGHT");
dNames.Add("LENGTH");
dNames.Add("PRIMARYWEIGHT");
dNames.Add("PROFILE_WEIGHT");
dNames.Add("ROUNDING_RADIUS");
dNames.Add("LENGTH");
dNames.Add("DIAMETER");
dNames.Add("WEIGHT");
dNames.Add("HEAD_DIAMETER");
dNames.Add("THICKNESS");
dNames.Add("WASHER.THICKNESS");
dNames.Add("WASHER.INNER_DIAMETER");
dNames.Add("WASHER.OUTER_DIAMETER");
dNames.Add("WASHER.THICKNESS1");
dNames.Add("WASHER.INNER_DIAMETER1");
dNames.Add("WASHER.OUTER_DIAMETER1");
dNames.Add("WASHER.THICKNESS2");
dNames.Add("WASHER.INNER_DIAMETER2");
dNames.Add("WASHER.OUTER_DIAMETER2");
dNames.Add("NUT.THICKNESS");
dNames.Add("NUT.INNER_DIAMETER");
dNames.Add("NUT.OUTER_DIAMETER");
dNames.Add("NUT.THICKNESS2");
dNames.Add("NUT.OUTER_DIAMETER2");
ModelObjectEnumerator.AutoFetch = true;
ModelObjectEnumerator myEnum = myModel.GetModelObjectSelector().GetAllObjectsWithType(new Type[] { typeof(BoltGroup) });
while (myEnum.MoveNext())
{
try
{
myObject = myEnum.Current as ModelObject;
if (myObject != null)
{
Hashtable sValues = new Hashtable(sNames.Count + dNames.Count + iNames.Count);
if (myObject.GetAllReportProperties(sNames, dNames, iNames, ref sValues))
{
foreach (DictionaryEntry value in sValues)
Console.WriteLine(value.Key.ToString() + " : " + value.Value.ToString());
}
}
}
catch { }
}
}
}
StringNames: An array list containing the names of the string properties.
DoubleNames: An array list containing the names of the double properties.
IntegerNames: An array list containing the names of the integer properties.
Values: The return value, a hash table list  that contains all the values that were retrieved successfully.
Returns: True if at least one single property was retrieved successfully.

Tekla.Structures.Model.ModelObject.SetUserProperty(System.String,System.String)
Sets a string property for the model object.
Name: The name of the property to be set.
Value: The new value for the property.
Returns: True if the property was set successfully.

Tekla.Structures.Model.ModelObject.SetUserProperty(System.String,System.Double)
Sets a double property for the model object.
Name: The name of the property to be set.
Value: The new value for the property.
Returns: True if the property was set successfully.

Tekla.Structures.Model.ModelObject.SetUserProperty(System.String,System.Int32)
Sets an integer property for the model object.
Name: The name of the property to be set.
Value: The new value for the property.
Returns: True if the property was set successfully.

Tekla.Structures.Model.ModelObject.SetPhase(Tekla.Structures.Model.Phase)
Sets the phase of the model object.
Phase: The new phase. A phase with this phase's number must exist in the database.
Returns: True on success.

Tekla.Structures.Model.ModelObject.GetPhase(Tekla.Structures.Model.Phase@)
Retrieves the phase of the model object (the phase number, the phase name,
the phase comment and whether the phase is the current one or not).
Phase: The returned phase.
Returns: True on success.

Tekla.Structures.Model.ModelObject.SetLabel(System.String)
Sets a label for an object when a new instance is created.
The label is used in plug-ins for identifying the changed object in modification.
Label: The label to set to the model object.
Returns: True on success.